[
  {
    "id": "1",
    "post_title": "86% Indians feel voting should be made compulsory: Public App Survey",
    "slug": "1",
    "des": "On the occasion of the 12th National Voters’ Day, Public App, India’s largest location-based social network, conducted a survey to understand how seriously Indians take their voting rights and on what factors they evaluate for which candidate to choose. This pan-India poll was conducted with a sizable data pool of over 4 lakh people. As a part of the survey, as many as 86% of respondents were in agreement when asked if voting should be made mandatory in the country."
  },

  {
    "id": "2",
    "post_title": "43% say they kept their New Year’s resolution last year: Public ki Awaaz poll",
    "slug": "2",
    "des": "As 2021 draws to a close end, users of location-based social network Public weighed in their views on the age-old tradition of making New Year’s resolutions. A New Year’s resolution is a common practice in which a person resolves to continue good habits, change an undesired trait or behavior, accomplish a personal goal, or otherwise improve their life at the start of a year.And with the spirit of a new year dawning upon us, Public’s recurring poll series ‘Public ki Awaaz’ sought to understand the intentions of Bharat users on making and keeping their resolutions. The poll garnered over 5.7 lakh responses."
  },

  {
    "id": "3",
    "post_title": "68% approve of Centre’s decision to withdraw farm bills: Public ki Awaaz poll",
    "slug": "Horoscope-For-Today-February-20-2022-1",
    "des": "While addressing the nation on November 19, Prime Minister Narendra Modi announced that the three contentious farm laws -The Farmers’ Produce Trade and Commerce (Promotion and Facilitation) Bill, 2020, The Farmers (Empowerment and Protection) Agreement of Price Assurance and Farm Services Bill, 2020 & The Essential Commodities (Amendment) Bill, 2020 – would be repealed in the upcoming session of Parliament. The move comes after months of protests by agitating farmers & several farmers’ organizations who fear that the laws will pave the way for corporate exploitation. In the big announcement, the PM also urged “all protesting farmers to return to their homes and farms”."
  }
]
