<p>As 2021 draws to a close end, users of location-based social network Public weighed in their views on the age-old tradition of making New Year&rsquo;s resolutions. A New Year&rsquo;s resolution is a common practice in which a person resolves to continue good habits, change an undesired trait or behavior, accomplish a personal goal, or otherwise improve their life at the start of a year.</p>
<p>And with the spirit of a new year dawning upon us, Public&rsquo;s recurring poll series &lsquo;Public ki Awaaz&rsquo; sought to understand the intentions of Bharat users on making and keeping their resolutions. The poll garnered over 5.7 lakh responses.<br /><br /></p>
<p><strong>New Year, New Me?</strong></p>
<p>&nbsp;</p>
<p>While bidding this year a farewell, a majority of Public&rsquo;s users (54.5%) expressed their desire to make a New Year&rsquo;s resolution in 2022. Respondents said they&rsquo;re heading into the new year with a commitment to prioritise physical health as about &frac14; users (25.4%) resolve to care more about their well-being by adopting healthy habits like exercising and sticking to a healthy diet. Other common commitments people intend to make are: making more time for family &amp; relationships (18%), giving up bad habits (<em>cigarettes, alcohol, lying</em>) (17.5%), economic saving &amp; investment (17%). 21% chose none of the mentioned as their resolution goals.</p>
<p>Interestingly, even though the overall optimism to set goals stands fairly high, at least 16.5% said they will not make a resolution at all.</p>
<p><strong><br />Last year this time&hellip;<br /><br /></strong></p>
<p>Every year, millions of people make New Year&rsquo;s resolutions, hoping to spark positive change and 2021 was no different. When asked if they made a resolution for the departing year, about 53% users said they did. About 26% said they didn&rsquo;t while 21% remained unsure.</p>
<p>For the most part, resolutions among Indians haven&rsquo;t changed too much in the past year either. Recurring themes of physical upkeep and giving up bad habits topped the lists at 28.5% and 24% respectively. Followed closely by spending more time with family &amp; friends (17.7%) and economic saving &amp; investment (8%). As compared to the approaching year,&nbsp;a greater number of people (25.9%) said they did not make a resolution last year.</p>
<p><strong><br />Resolution makers, resolution keepers<br /><br /></strong></p>
<p>When asked if the respondents were able to keep their resolutions for 2021, the response seemed fairly positive as close to 43% said they could. However, despite the best of intentions, once the glow of a fresh year wears off, many people struggle to make good on their plans. This resonated with the response of about 30% users who said they could either not keep their resolutions or only a few goals were met. About 27% said they don&rsquo;t remember.</p>
<p>And what makes up for a goal deterrent? At 27%, laziness is the topmost reason for not following through with a New Year&rsquo;s resolution according to the users. Participants also cited avoidance (17%)&nbsp; and lack of consistency (16%) for the same. A&nbsp; majority of 41% remained unsure of the reason.</p>